; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_2 ?v1 - type_3 ?v6 - type_2)
 	      (pred_1 ?v4 - object ?v6 - type_2)
	      (pred_4 ?v1 - type_3 ?v8 - type_1)
	      (pred_3 ?v1 - type_3 ?v4 - object ?v8 - type_1))

   (:action op_1
       :parameters  (?v1 - type_3 ?v5 ?v2 - type_2)
       :precondition (and  (pred_2 ?v1 ?v5))
       :effect (and  (pred_2 ?v1 ?v2)
		     (not (pred_2 ?v1 ?v5))))

   (:action op_3
       :parameters (?v1 - type_3 ?v7 - object ?v3 - type_2 ?v8 - type_1)
       :precondition  (and  (pred_1 ?v7 ?v3) (pred_2 ?v1 ?v3) (pred_4 ?v1 ?v8))
       :effect (and (pred_3 ?v1 ?v7 ?v8)
		    (not (pred_1 ?v7 ?v3)) 
		    (not (pred_4 ?v1 ?v8))))

   (:action op_2
       :parameters (?v1 - type_3 ?v7 - object ?v3 - type_2 ?v8 - type_1)
       :precondition  (and  (pred_3 ?v1 ?v7 ?v8) (pred_2 ?v1 ?v3))
       :effect (and (pred_1 ?v7 ?v3)
		    (pred_4 ?v1 ?v8)
		    (not (pred_3 ?v1 ?v7 ?v8)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_12 obj_13 - type_3
obj_06 obj_10 obj_01 obj_02 - type_1
obj_08 obj_09 obj_11 obj_05 - type_2
obj_03 obj_04 obj_07 - object)
(:init
(pred_2 obj_12 obj_05)
(pred_4 obj_12 obj_06)
(pred_4 obj_12 obj_10)
(pred_2 obj_13 obj_11)
(pred_4 obj_13 obj_01)
(pred_4 obj_13 obj_02)
(pred_1 obj_03 obj_09)
(pred_1 obj_04 obj_08)
(pred_1 obj_07 obj_08)
)
(:goal
(and
(pred_1 obj_03 obj_11)
(pred_1 obj_04 obj_05)
(pred_1 obj_07 obj_09)
)
)

(:constraints
  (always (not (pred_2 obj_12 obj_11)))
)
)

; plan
1. (op_1 obj_12 obj_05 obj_08)
   deleted: (pred_2 obj_12 obj_05)
   added: (pred_2 obj_12 obj_08)
   goals met: 0 of 3
2. (op_1 obj_13 obj_11 obj_09)
   deleted: (pred_2 obj_13 obj_11)
   added: (pred_2 obj_13 obj_09)
   goals met: 0 of 3
3. (op_3 obj_12 obj_04 obj_08 obj_10)
   deleted: (pred_1 obj_04 obj_08) (pred_4 obj_12 obj_10)
   added: (pred_3 obj_12 obj_04 obj_10)
   goals met: 0 of 3
4. (op_3 obj_13 obj_03 obj_09 obj_02)
   deleted: (pred_1 obj_03 obj_09) (pred_4 obj_13 obj_02)
   added: (pred_3 obj_13 obj_03 obj_02)
   goals met: 0 of 3
5. (op_1 obj_12 obj_08 obj_05)
   deleted: (pred_2 obj_12 obj_08)
   added: (pred_2 obj_12 obj_05)
   goals met: 0 of 3
6. (op_1 obj_13 obj_09 obj_08)
   deleted: (pred_2 obj_13 obj_09)
   added: (pred_2 obj_13 obj_08)
   goals met: 0 of 3
7. (op_2 obj_12 obj_04 obj_05 obj_10)
   deleted: (pred_3 obj_12 obj_04 obj_10)
   added: (pred_1 obj_04 obj_05) (pred_4 obj_12 obj_10)
   goals met: 1 of 3
8. (op_3 obj_13 obj_07 obj_08 obj_01)
   deleted: (pred_1 obj_07 obj_08) (pred_4 obj_13 obj_01)
   added: (pred_3 obj_13 obj_07 obj_01)
   goals met: 1 of 3
9. (op_1 obj_13 obj_08 obj_09)
   deleted: (pred_2 obj_13 obj_08)
   added: (pred_2 obj_13 obj_09)
   goals met: 1 of 3
10. (op_2 obj_13 obj_07 obj_09 obj_01)
   deleted: (pred_3 obj_13 obj_07 obj_01)
   added: (pred_1 obj_07 obj_09) (pred_4 obj_13 obj_01)
   goals met: 2 of 3
11. (op_1 obj_13 obj_09 obj_11)
   deleted: (pred_2 obj_13 obj_09)
   added: (pred_2 obj_13 obj_11)
   goals met: 2 of 3
12. (op_2 obj_13 obj_03 obj_11 obj_02)
   deleted: (pred_3 obj_13 obj_03 obj_02)
   added: (pred_1 obj_03 obj_11) (pred_4 obj_13 obj_02)
   goals met: 3 of 3
